## Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the  DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [37]:
d=pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]},index=[1,3,5])

In [38]:
d

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [40]:
df=pd.DataFrame({'values':[10,20,30,40,50]})

In [41]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [55]:
df[['values']][0:3].sum()

values    60
dtype: int64

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [94]:
df=pd.DataFrame({'Text':['Prateek','Sonu']})

In [95]:
df

      Text
0  Prateek
1     Sonu

In [96]:
def Word_Count(text):
    w=list(text)
    return len(w)

In [97]:
df['Word_Count']=df['Text'].apply(Word_Count)

In [98]:
df

      Text  Word_Count
0  Prateek           7
1     Sonu           4

## Q5. How are DataFrame.size() and DataFrame.shape() different?

## Ans
## DataFrame.size: Returns the total number of elements in the DataFrame.
## DataFrame.shape: Returns a tuple representing the dimensions of the DataFrame.

## Q6. Which function of pandas do we use to read an excel file?

## Ans  pd.read_excel()

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [130]:
df=pd.DataFrame({'Email':['Prateek@gmail.com','Sonu@gmail.com']})

In [131]:
df

               Email
0  Prateek@gmail.com
1     Sonu@gmail.com

In [132]:
def Username(Email):
    l=''
    for i in Email:
        l+=i
        if i=='@':
            break
    return l[0:len(l)-1]

In [133]:
df['User']=df['Email'].apply(Username)

In [134]:
df

               Email     User
0  Prateek@gmail.com  Prateek
1     Sonu@gmail.com     Sonu

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [142]:
df=pd.DataFrame({'A':[1,2,3,6,5,74,25],'B':[4,5,6,1,2,3,4],'C':[7,8,9,10,20,30,50]})

In [143]:
df

    A  B   C
0   1  4   7
1   2  5   8
2   3  6   9
3   6  1  10
4   5  2  20
5  74  3  30
6  25  4  50

In [144]:
df[(df['A']>5) & (df['B']<10)]

    A  B   C
3   6  1  10
5  74  3  30
6  25  4  50

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [145]:
df=pd.DataFrame({'values':[10,20,30,40,50]})

In [153]:
df['values'].mean()

30.0

In [154]:
df['values'].median()

30.0

In [155]:
df['values'].std()

15.811388300841896

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [156]:
def add_moving_average_column(df):
    # Check if the 'Sales' and 'Date' columns exist in the DataFrame
    if 'Sales' not in df.columns or 'Date' not in df.columns:
        print("Error: 'Sales' or 'Date' column not found in the DataFrame.")
        return

    # Convert the 'Date' column to datetime type
    df['Date'] = pd.to_datetime(df['Date'])

    # Sort the DataFrame by date if not already sorted
    df = df.sort_values(by='Date')

    # Calculate the moving average using a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

# Example usage:
# Assuming df is your DataFrame with the 'Sales' and 'Date' columns
# Replace this with your actual DataFrame
df = pd.DataFrame({
    'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06', '2022-01-07'],
    'Sales': [10, 20, 15, 25, 30, 18, 22]
})

# Call the function to add the 'MovingAverage' column
add_moving_average_column(df)

# Display the DataFrame with the new 'MovingAverage' column
print(df)

        Date  Sales
0 2022-01-01     10
1 2022-01-02     20
2 2022-01-03     15
3 2022-01-04     25
4 2022-01-05     30
5 2022-01-06     18
6 2022-01-07     22

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [159]:
df=pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

In [160]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [161]:
df['Weekday']=['Sunday','Monday','Tuesday','Wednesday','Thursday']

In [162]:
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [163]:
df=pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05','2023-02-01']})

In [164]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-02-01

In [169]:
s=pd.to_datetime('2023-01-01')
e=pd.to_datetime('2023-01-31')
df['Date'] = pd.to_datetime(df['Date'])
df[(df['Date'] > s) & (df['Date'] < e)]

        Date
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [170]:
## Ans
import pandas as pd